cask_args appdir: "/Users/helior/Applications"
## Run `brew bundle` to install these.
## Make sure we’re using the latest Homebrew
#update

## Upgrade any already-installed formulae
#upgrade

## Replaces Mac OS utilities with GNU
brew "coreutils"

## brew more recent versions of some OS X tools
# tap homebrew/dupes
tap "caskroom/versions"
brew "vim"
brew "homebrew/dupes/grep"
brew "zsh"

## Version Control
brew "git"
brew "hub"
brew "gpg"
brew "git-extras"

## PHP Development
# tap josegonzalez/homebrew-php
# brew php55
# brew composer
# brew drush

## Ruby Development
#brew rbenv
#brew ruby-build

## NodeJS Development
brew "yarn"

## iOS Development
# brew swiftlint

## Android Development
# brew android-sdk
# cask  java8  # required for React-native

## Devops Tooling
#tap homebrew/binary
#brew packer

## Applications
brew "mackup"
tap "caskroom/cask"

# Fun stuff
brew "youtube-dl"

# cask  alfred
# cask  all2mp3
# cask  caffeine
# cask  colloquy
# cask  dropbox
# cask  evernote
# cask  google-chrome
# cask  google-hangouts
# cask  kaleidoscope
# cask  ksdiff
# cask  lastfm
# cask  nvalt
## cask  omnifocus
## cask  phpstorm
cask  "qlcolorcode"
cask  "qlmarkdown"
cask  "qlprettypatch"
cask  "qlstephen"
cask  "quicklook-csv"
cask  "quicklook-json"
# cask  sequal-pro
# cask  silverlight
# cask  sublime-text
# cask  transmission
# cask  vagrant
# cask  virtualbox
#cask  minikube
#cask  cakebrew
